<!--用户协议-->
<template>
  <div class="yhxy">
    <div class="van-nav-bar-top">
      <van-nav-bar
        :title="titleName"
        :left-arrow="leftArrow"
        @click-left="back"
        @click-right="">
      </van-nav-bar>
    </div>

    <div class="content">
      <h5>用户服务协议</h5>
      <p class="titl">一、 本协议的签署和修订</p>
      <p>1.1 花花世界平台（以下简称“本平台”）只接受持有中国有效身份证明的22周岁至45周岁具有完全民事行为能力的自然人成为用户。如您不符合资格，请停止注册操作，否则本平台有权随时中止或终止您的用户资格。</p>
      <p>1.2 本协议内容包括以下条款及本平台已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的一部分，与协议正文具有同等法律效力。本协议是您与本平台平台共同签订的，适用于您在本平台的全部活动。在您注册成为用户时，您已经阅读、理解并接受本协议的全部条款及各类规则，并承诺遵守中国的各类法律、法规、政策的规定，如有违反而导致任何法律后果的发生，您将以自己的名义独立承担所有相应的法律责任。</p>
      <p>1.3 本平台有权根据相关法律、法规、政策的要求及提供服务的需要不时地修改本协议或根据本协议制定、修改各类具体规则并在本平台相关系统板块发布，请您适时注意本协议及具体规则的变更。若您在本协议及具体规则内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议和具体规则内容，也将遵循修改后的协议和具体规则使用本平台的服务；同时就您在协议和具体规则修订前通过本平台进行的交易及其效力，视为您已同意并已按照本协议及有关规则进行了相应的授权和追认。若您不同意修改后的协议内容，您可以在偿还已发生的全部借款及服务费（包括但不限于本金、利息、平台服务费、贷款管理费、逾期管理费等）的前提下，选择停止使用本平台的服务。</p>
      <p>1.4 您通过自行或授权有关方根据本协议及本平台有关规则、说明操作确认本协议后，本协议即在您和本平台之间产生法律效力。本协议不涉及您与本平台的其他用户之间因网上交易而产生的法律关系或法律纠纷，但您在此同意将全面接受和履行与本平台其他用户在本平台签订的任何电子法律文本，并承诺按该等法律文本享有和/或放弃相应的权利、承担和/或豁免相应的义务。</p>

      <p class="titl">二、 服务的提供</p>
      <p>2.1 本平台提供的服务包括但不限于：身份验证、手机号码验证、个人信息及资料审核、账户开立及维护、信用咨询与评估、向出借人提交授信及贷款申请、反馈授信审批结果，贷款信息展示、还款进度查询、还款指令反馈、逾期还款通知及管理等，具体详情以本平台当时提供的服务内容为准。您理解并同意，本平台有权根据您提供的各项信息及本平台独立获得的信息评定您在本平台所拥有的个人信用等级，或决定是否审核通过您向出借人发出的借款申请。</p>
      <p>2.2 基于运行和交易安全的需要，本平台可以暂时停止提供、限制或改变本平台服务的部分功能，或提供新的功能。在任何功能减少、增加或者变化时，只要您仍然使用本平台的服务，表示您仍然同意本协议或者变更后的协议。</p>
      <p>2.3 您确认，您在本平台上按本平台服务流程所确认的交易状态将成为本平台为您进行相关交易或操作的明确指令。您同意本平台有权按相关指令依据本协议和/或有关文件和规则对相关事项进行处理。</p>
      <p>2.4您须对使用用户的用户名和密码所采取的一切行为负责。因此，请您不要向任何第三方披露您或其他用户在本平台的用户名和密码，否则由此造成的损失由您自行承担。</p>
      <p>2.5 您注册成功后应妥善保管您的用户名和密码。您确认，无论是您还是您的代理人，用您的用户名和密码登录本平台后在本平台的一切操作行为均代表您的真实意思表示，并由您承担相应的法律后果。</p>
      <p>2.6 因下列原因所引起的任何纠纷或损失由您本人负责解决和承担，本平台不承担任何责任：</p>
      <p class="mgl20">（1）您向本平台提交的任何信息存在不真实、不完整等情形；</p>
      <p class="mgl20">（2）您未能向本平台提交有效申请；</p>
      <p class="mgl20">（3）您未及时对交易状态进行修改或确认；</p>
      <p class="mgl20">（4）其他非因本平台所产生的原因。</p>

      <p class="titl">三、 用户信息及隐私权保护</p>
      <p>3.1 用户信息的获取、提供及核实</p>
      <p>3.1.1您有义务在使用花花世界平台服务时提供自己的真实信息（包括但不限于提供真实有效的身份证件信息、照片信息、联系方式信息、地址信息等），并保证诸如联系电话、联系地址等内容的真实性、有效性和及时更新，以便花花世界平台为您提供服务并与您进行及时、有效的联系。</p>
      <p>3.1.2根据国家有关法律、法规及金融监管政策的规定，花花世界平台须对您注册并使用本平台服务的相关行为进行实名认证。同时，为了向您提供更加高效和精准的服务（包括但不限于对您提交的相关资料进行反欺诈验证、为您快速匹配合适的出借方、接受出借方的委托对您的信用状况及授信额度进行评估、为您提供贷后管理服务等），本平台将基于以上目的，在遵守相关法律法规的前提下，自行或委托合法的第三方机构获取您的下述必要个人信息：</p>
      <p class="mgl20">（1）身份信息：姓名、身份证件信息等；</p>
      <p class="mgl20">（2）联系信息：个人联系电话、联系人联系电话等；</p>
      <p class="mgl20">（3）工作信息：工作单位名称、地址、联系电话、公积金缴纳情况等；</p>
      <p class="mgl20">（4）银行卡信息；</p>
      <p class="mgl20">（5）手机通讯信息：手机设备信息、通讯录、短信、通话记录、手机应用情况、运营商信息等；</p>
      <p class="mgl20">（6）个人信用信息：个人征信情况、芝麻信用情况、失信被执行人情况等；</p>
      <p class="mgl20">（7）个人学历信息等。</p>
      <p>3.1.3您同意花花世界平台可以自行或通过合法的第三方机构对您的相关信息及资料进行真实性和有效性验证，同时基于提供本平台相关服务之必要对获得的验证结果进行查看、使用和留存等操作。您理解并同意：在进行真实性、有效性验证的过程中，花花世界平台不可避免地须向有关第三方提供您的必要个人信息：包括但不限于您的姓名、证件号码、手机号码、银行卡信息等。</p>
      <p>3.2 用户信息的使用、保护及披露</p>
      <p>3.2.1您理解并同意花花世界平台可以对您的相关信息及资料进行分析，并将分析结果用于改善花花世界平台的设计、服务及产品推广形式等目的。</p>
      <p>3.2.2花花世界平台将按国家相关法律、法规及政策的要求，对于您的个人信息采取严格的保密措施，不向任何无关第三方披露您的个人信息。同时，花花世界平台将采取必要的技术手段、同时完善相关安全管理制度的建设，以确保您的信息安全。但以下情形不构成花花世界平台违反信息保密义务：</p>
      <p class="mgl20">（1）根据本协议第3.1.3条约定之目的向您同意的合法第三方提供您的有关个人信息；</p>
      <p class="mgl20">（2）根据出借方的要求，提供您的必要个人信息，以配合出借方对您完成必要的风控措施；</p>
      <p class="mgl20">（3）根据有权机关/部门（包括但不限于公安机关、司法机关、金融监管部门、工商部门、网信部门等）之要求，披露或提供您的有关个人信息；</p>
      <p class="mgl20">（4）因地震、火灾、计算机病毒、黑客攻击等不可抗力因素导致的信息泄露等。</p>

      <p class="titl">四、 其他</p>
      <p>4.1本平台对本协议拥有最终的解释权。本协议及本平台有关页面的相关名词可互相引用参照，如有不同理解，则以本协议条款为准。此外，若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效。</p>
      <p>4.2因您使用本平台所提供的服务所导致的一切争议或纠纷，您与本平台可通过友好协商方式解决。协商不成的，双方一致同意提请XX市仲裁委员会仲裁，并适用其网络仲裁规则（包括适用互联网金融仲裁特别规定条款），当地仲裁委员会的裁决为终局裁决，对仲裁双方具有法律约束力。</p>

      <p class="titl">附件一</p>
      <p>花花世界平台用户隐私协议</p>

      <p class="titl">第一章 序言</p>
      <p>第一条 花花世界平台（以下或称“本平台”）尊重并保护用户信息及隐私安全，根据国家相关法律法规及政策的规定，制订本《隐私政策》。在您使用本平台服务时，本平台将按照本隐私政策规定的范围、用途及方式收集、使用和提供您的个人信息。一旦您选择点击确认本隐私政策，即表示您认可并接受本政策现有内容及其可能随时更新的内容。</p>
      <p>第二条 如果您对本隐私政策的任何内容有任何异议或疑问，您应暂停注册及使用本平台服务。本平台工作人员将对您的疑问和意见作出答复和处理。当您使用本平台提供的任一服务时，即表示您已同意本平台按照本隐私政策来合法收集、使用、提供和保护您的个人信息。</p>

      <p class="titl">第二章 适用范围</p>
      <p>第三条 本隐私政策适用于所有注册及使用本平台服务的用户，适用环节覆盖本平台提供的所有服务。</p>

      <p class="titl">第三章 信息收集</p>
      <p>第四条 【您向本平台提供的信息】</p>
      <p>您在访问、注册本平台账户或申请使用本平台服务时，必须提供本人真实的个人信息，且您应该根据实际变动情况及时更新个人信息。如果您不提供相关信息，可能无法注册成为本平台的用户或无法享受本平台提供的某些服务，或者无法达到相关服务拟达到的效果。</p>
      <p>根据国家相关法律、法规及金融监管政策的规定，本平台须对您注册及使用本平台服务的行为进行实名认证。当您在本平台申请注册及开户时，您必须至少向本平台提供下述必要个人信息，以配合本平台对您进行实名认证：</p>
      <p class="mgl20">（一）身份信息：姓名、身份证件信息等；</p>
      <p class="mgl20">（二）联系信息：个人联系电话、联系人联系电话、地址等；</p>
      <p class="mgl20">（三）运营商信息：运营商服务密码、授权等；</p>
      <p class="mgl20">（四）银行卡信息。</p>
      <p>第五条 【本平台在您使用服务过程中收集的信息】</p>
      <p>为了向您提供更加高效和精准的服务（包括但不限于对您提交的相关资料进行反欺诈验证、为您快速匹配合适的出借方、接受出借方的委托对您的信用状况及授信额度进行评估、为您提供贷后管理服务等），本平台将基于以上目的，在遵守相关法律法规的前提下，自行或委托合法的第三方机构获取您的下述必要个人信息：</p>
      <p class="mgl20">（一）手机通讯信息：手机设备信息、通讯录、短信、通话记录、手机应用情况、运营商信息等；</p>
      <p class="mgl20">（二）个人信用信息：个人征信情况、芝麻信用情况、失信被执行人情况等；</p>
      <p class="mgl20">（三）个人学历信息、公积金缴纳情况等信息。</p>

      <p class="titl">第四章 信息使用及披露</p>
      <p>第六条 您理解并同意，本平台可以对您提供的、本平台自行收集的及通过合法第三方获取的您的个人信息、您申请服务时的相关信息、您在使用服务时储存在本平台的相关资料及信息进行分析，并将分析结果用于改善本平台的设计、服务及产品推广形式等目的。</p>
      <p>本平台将对您的个人信息采取严格的保密措施。但基于以下情形，本平台有权对有关必要的主体披露您的相关个人信息：</p>
      <p class="mgl20">（一）事先经过您的明确授权时；</p>
      <p class="mgl20">（二）相关机构（包括但不限于公安机关、司法机关、工商部门、金融监管部门、网信部门等）依照法定程序要求本平台进行披露时；</p>
      <p class="mgl20">（三）为维护本平台其他用户及社会公众合法权益而有必要披露时；</p>
      <p class="mgl20">（四）违反本平台服务条款或其它规定，可能对本平台、合作网站或其它用户造成不利影响；</p>
      <p class="mgl20">（五）违反相关协议及法律法规的要求，需要进行必要合理催收的；</p>
      <p class="mgl20">（六）其他符合法律法规规定的情形。</p>

      <p class="titl">第五章 信息提供</p>
      <p>第七条 您理解并同意，本平台可以自行或通过合法的第三方机构对您的相关信息及资料进行真实性和有效性验证，同时基于提供本平台相关服务之必要对获得的验证结果进行查看、使用和留存等操作。您理解并同意：在进行真实性、有效性验证的过程中，本平台不可避免地须向有关第三方提供您的必要个人信息：包括但不限于您的姓名、证件号码、手机号码、银行卡信息等。</p>
      <p>本平台将严格遵守相关法律法规的规定，对您的信息承担保密义务。除以下情形外，我们不会将您的个人信息提供给第三方：</p>
      <p class="mgl20">（一）征得您的同意或授权提供您的个人信息；</p>
      <p class="mgl20">（二）根据法律法规的规定或应有权机关的要求（包括但不限于公安机关、司法机关、金融监管部门、工商部门、网信部门等）的要求提供您的个人信息；</p>
      <p class="mgl20">（三）出于实现“信息使用及披露”部分所述目的，或为履行我们在《花花世界用户服务协议》或本隐私政策中的义务和行使我们的合法权利，向关联方、合作伙伴等合法第三方提供您的个人信息。</p>

      <p class="titl">第六章 信息安全及免责事由</p>
      <p>第八条 本平台严格保护您的个人信息安全。我们将按相关法律法规的规定，通过相关信息安全管理制度、安全技术和程序等措施来保护您的个人信息不被非法访问、篡改、披露或破坏。但对因地震、火灾、水灾、现有网络安全措施无法对抗的计算机病毒、黑客攻击等不可抗力因素导致的信息泄露或破坏事件，本平台不承担任何责任。</p>

      <p class="titl">第七章 未成年人保护</p>
      <p>第九条 本平台要求年龄20周岁以下人士不要向本平台提交任何个人资料。</p>

      <p class="titl">第八章 法律适用及争议解决</p>
      <p>第十条 本隐私政策的订立、执行、解释及争议的解决均应适用中华人民共和国法律。</p>
      <p>第十一条 因本隐私政策引起的或与本隐私政策有关的任何争议，各方应友好协商解决；协商不成的，任何一方均可将有关争议提交至XX市仲裁委员会仲裁，当地仲裁委员会的裁决为终局裁决，对仲裁双方具有法律约束力。</p>

      <p class="titl">第九章 隐私政策的修改</p>
      <p>第十二条 根据相关法律法规及政策的规定，本平台或将不定期地对本隐私政策进行修改。本平台将通过官方网站、APP相关界面等及时公布修改后的隐私政策，您对修改后的隐私政策有任何异议或疑问的，您应暂停使用本平台服务。本平台工作人员将对您的疑问和意见作出答复和处理。您继续使用本平台相关服务的，视同您接受本平台修改后的隐私政策。</p>

      <p class="titl">第十章 生效时间</p>
      <p>第十三条 本隐私政策自发布之日起生效。</p>
      <p>特别声明：根据相关法律、法规、政策的规定，花花世界不向在校学生开放注册或提供任何服务。在校学生包括但不限于普通高中、职业高中、中等职业学校的在校学生，普通全日制高等院校的在校大专生、本科生、研究生等。如您属于上述所列范围的在校学生，请您停止注册及使用花花世界平台服务。您有义务向花花世界平台提供真实身份信息，不得隐瞒在校学生的身份。花花世界平台有权定期或不定期对您的身份信息进行核查，如发现您属于在校学生，花花世界平台有权立即向您停止提供相关服务，如您已在花花世界平台发生借款，花花世界平台有权要求您立即返还已经发生的借款及相关费用，同时终止向您提供服务，由此产生的相关法律责任由您本人承担。</p>

    </div>
  </div>

</template>

<script>

  import {CellGroup, Field, Icon, NavBar, Toast} from "vant";

  var storage = window.localStorage;
  var u = navigator.userAgent;
  var ISANDROID, ISIOS, ISWEIXIN;

  ISANDROID = u.indexOf('Android') > -1 || u.indexOf('Adr') > -1; //android终端
  ISIOS = !!u.match(/\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端
  ISWEIXIN = u.toLowerCase().indexOf('micromessenger') != -1;

  export default {
    components: {
      [NavBar.name]: NavBar,
      [Icon.name]: Icon,
      [Field.name]: Field,
      [CellGroup.name]: CellGroup,
      [Toast.name]: Toast,
    },
    data() {
      return {
        isAndroid: ISANDROID,
        isiOS: ISIOS,
        isWeixin: ISWEIXIN,
        leftArrow: true, // 返回箭头
        titleName: '协议详情',

      }
    },
    created() {

      this.telphone = this.$route.params.telphone;
      console.log(this.telphone)
    },

    methods: {
      back() {
        this.$router.back()
      },

    }

  }
</script>

<style lang="less">
  @import "../../common/base.less";
  @import "../../reset.less";

  /*@media only screen and (device-width: 375px) and (device-height: 812px) and (-webkit-device-pixel-ratio: 3) {*/
  /*.yhxy {*/
  /*.van-nav-bar {*/
  /*padding-top: 0.48rem !important;*/
  /*height: 1.36rem !important;*/
  /*}*/
  /*.list {*/
  /*margin-top: 3.26rem !important;*/
  /*&.collectionList {*/
  /*margin-top: 2.54rem !important;*/
  /*}*/
  /*}*/
  /*.content {*/
  /*padding: 0.72rem 0 1.2rem !important;*/
  /*}*/
  /*}*/
  /*}*/

  .yhxy {
    .van-hairline--bottom::after {
      border-bottom-width: 0;
    }
    background-color: #ffffff;
    min-height: 100vh;
    .van-nav-bar-top {
      background-color: #ffffff;
      position: fixed;
      width: 100%;
      left: 0;
      top: 0;
      z-index: 1;
    }
    .van-nav-bar {
      /*padding-top: 0.4rem;*/
      /*height: 1.28rem;*/
      background-color: @title_bgColor;
      height: 0.88rem;
      line-height: 0.88rem;
      color: #333333;
      .van-nav-bar__left {
        left: 0;
        padding: 0 0.26rem;
        font-size: 0.36rem;
        vertical-align: middle;
      }
      .van-icon {
        color: @title_color;
        width: 0.36rem;
        vertical-align: middle;
        font-weight: bold;
      }
      .van-nav-bar__title {
        font-family: "PingFangSC-Medium";
        color: @title_color;
        font-size: 0.36rem;
        font-weight: bold
      }
    }
    .van-hairline--bottom::after {
      border-bottom-width: 0 !important;
    }
    [class*=van-hairline]::after {
      border: 0 solid @theme_bgColor !important;
    }

    .van-cell {
      width: 100%;
      display: -webkit-box;
      display: -webkit-flex;
      display: flex;
      padding: 0.27rem 0;
      box-sizing: border-box;
      line-height: 24px;
      position: relative;
      background-color: #fff;
      color: #333;
      font-size: 0.32rem;
      font-weight: 500;
      overflow: hidden;
    }
    .van-cell-group .van-hairline--top-bottom {
      border-bottom: 0px solid #ffffff;
    }

  }
</style>

<style lang="less" scoped>
  .yhxy {

    .content {
      padding: 0.88rem 0 1.2rem;
      background: #FFFFFF;
      overflow: hidden;
      margin: 10px 15px;
      box-sizing: border-box;
      border-radius: 6px;
    }

    h5 {
      width: 100%;
      text-align: center;
      margin: 15px 0;
    }

    .titl {
      font-weight: bold;
    }

    .small {
      font-size: 10px;
    }

  }

</style>
